wyniki_zwykle/fio_results_xfs_hdd/block_size_2048_compression_none/lab-sec-15/fio_archive_test_output.txt
archive_test: (g=0): rw=write, bs=(R) 64.0KiB-128KiB, (W) 64.0KiB-128KiB, (T) 64.0KiB-128KiB, ioengine=libaio, iodepth=128
...
fio-3.36
Starting 2 processes
archive_test: Laying out IO file (1 file / 10240MiB)
archive_test: Laying out IO file (1 file / 10240MiB)

archive_test: (groupid=0, jobs=2): err= 0: pid=56734: Fri May  2 22:00:03 2025
  write: IOPS=1708, BW=139MiB/s (146MB/s)(20.0GiB/147462msec); 0 zone resets
    slat (usec): min=2, max=4374, avg=28.82, stdev=30.01
    clat (usec): min=872, max=526615, avg=149670.31, stdev=18591.83
     lat (usec): min=915, max=526630, avg=149699.12, stdev=18591.37
    clat percentiles (msec):
     |  1.00th=[  125],  5.00th=[  138], 10.00th=[  140], 20.00th=[  144],
     | 30.00th=[  146], 40.00th=[  148], 50.00th=[  148], 60.00th=[  150],
     | 70.00th=[  150], 80.00th=[  153], 90.00th=[  157], 95.00th=[  163],
     | 99.00th=[  230], 99.50th=[  264], 99.90th=[  384], 99.95th=[  460],
     | 99.99th=[  518]
   bw (  KiB/s): min=76928, max=171819, per=100.00%, avg=142349.75, stdev=7020.92, samples=588
   iops        : min=  942, max= 2050, avg=1709.87, stdev=84.15, samples=588
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 50=0.03%, 100=0.44%
  lat (msec)   : 250=98.84%, 500=0.64%, 750=0.03%
  cpu          : usr=1.11%, sys=2.09%, ctx=45288, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,251984,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=139MiB/s (146MB/s), 139MiB/s-139MiB/s (146MB/s-146MB/s), io=20.0GiB (21.5GB), run=147462-147462msec

Disk stats (read/write):
  sda: ios=0/32547, sectors=0/41909993, merge=0/219513, ticks=0/4859435, in_queue=4864965, util=90.59%